publish/2017/GitBucket-on-Windows7-with-Tomcat8.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2020-09-12 Sat 07:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GitBucket + Tomcat + Java on Windows 7</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="clothoid" />
<meta name="keywords" content="git" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://clothoid.github.io/sitemap.html"> UP </a>
 |
 <a accesskey="H" href="https://clothoid.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">GitBucket + Tomcat + Java on Windows 7</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9a9e427">1. 環境</a></li>
<li><a href="#org8be2388">2. Git サーバーの構築</a>
<ul>
<li><a href="#org6fd0b3f">2.1. Java 8 のダンロード</a></li>
<li><a href="#orgc3ab5eb">2.2. Tomcat 8 のインストール</a></li>
<li><a href="#org5614b0f">2.3. GitBucket のインストールと起動</a></li>
</ul>
</li>
<li><a href="#orgce5346f">3. 参考</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9a9e427" class="outline-2">
<h2 id="org9a9e427"><span class="section-number-2">1</span> 環境</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>サーバー
<ul class="org-ul">
<li>Windows 7 Professional SP1</li>
<li>Java version 8 Update 151</li>
<li>Tomcat 8.5.24</li>
<li>GitBucket 4.19.2</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org8be2388" class="outline-2">
<h2 id="org8be2388"><span class="section-number-2">2</span> Git サーバーの構築</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6fd0b3f" class="outline-3">
<h3 id="org6fd0b3f"><span class="section-number-3">2.1</span> Java 8 のダンロード</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li><a href="https://java.com/ja/download/manual.jsp">https://java.com/ja/download/manual.jsp</a> にアクセス</li>
<li>[Windows オフライン (64 ビット)]をダンロード</li>
<li>画面にしたがいインストール</li>
</ol>
</div>
</div>

<div id="outline-container-orgc3ab5eb" class="outline-3">
<h3 id="orgc3ab5eb"><span class="section-number-3">2.2</span> Tomcat 8 のインストール</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li><a href="http://tomcat.apache.org/download-80.cgi">http://tomcat.apache.org/download-80.cgi</a> にアクセス</li>
<li>32-bit/64-bit Windows Service Installer をダウンロード</li>
<li>画面にしたがいインストール (ここでは F:/Program Files にインストール)</li>
<li><p>
conf/server.xml を、下記の通り変更 (検索キーワード文字化け防止)
</p>
<div class="org-src-container">
<pre class="src src-html">*** "C:\Program Files\Apache Software Foundation\Tomcat 8.5\conf\server.xml.orig" 2017-12-05 18:29:45.385705900 +0900
--- "C:\Program Files\Apache Software Foundation\Tomcat 8.5\conf\server.xml" 2017-12-05 18:31:52.572705900 +0900
***************
*** 68,74 ****
      --&gt;
      &lt;<span style="color: #006699;">Connector</span> <span style="color: #BA36A5;">port</span>=<span style="color: #008000;">"8080"</span> <span style="color: #BA36A5;">protocol</span>=<span style="color: #008000;">"HTTP/1.1"</span>
                 <span style="color: #BA36A5;">connectionTimeout</span>=<span style="color: #008000;">"2../0000"</span>
!                <span style="color: #BA36A5;">redirectPort</span>=<span style="color: #008000;">"8443"</span> /&gt;
      <span style="color: #8D8D84;">&lt;!-- </span><span style="color: #8D8D84; font-style: italic;">A "Connector" using the shared thread pool</span><span style="color: #8D8D84;">--&gt;</span>
      <span style="color: #8D8D84;">&lt;!--</span><span style="color: #8D8D84; font-style: italic;"></span>
<span style="color: #8D8D84; font-style: italic;">      &lt;Connector executor="tomcatThreadPool"</span>
<span style="color: #8D8D84; font-style: italic;">--- 68,76 ----</span>
<span style="color: #8D8D84; font-style: italic;">      </span><span style="color: #8D8D84;">--&gt;</span>
      &lt;<span style="color: #006699;">Connector</span> <span style="color: #BA36A5;">port</span>=<span style="color: #008000;">"8080"</span> <span style="color: #BA36A5;">protocol</span>=<span style="color: #008000;">"HTTP/1.1"</span>
                 <span style="color: #BA36A5;">connectionTimeout</span>=<span style="color: #008000;">"2../0000"</span>
!                <span style="color: #BA36A5;">redirectPort</span>=<span style="color: #008000;">"8443"</span>
!                <span style="color: #BA36A5;">URIEncoding</span>=<span style="color: #008000;">"UTF-8"</span>
!                <span style="color: #BA36A5;">useBodyEncodingForURI</span>=<span style="color: #008000;">"true"</span> /&gt;
      <span style="color: #8D8D84;">&lt;!-- </span><span style="color: #8D8D84; font-style: italic;">A "Connector" using the shared thread pool</span><span style="color: #8D8D84;">--&gt;</span>
      <span style="color: #8D8D84;">&lt;!--</span><span style="color: #8D8D84; font-style: italic;"></span>
<span style="color: #8D8D84; font-style: italic;">      &lt;Connector executor="tomcatThreadPool"</span>
</pre>
</div></li>
</ol>
</div>
</div>

<div id="outline-container-org5614b0f" class="outline-3">
<h3 id="org5614b0f"><span class="section-number-3">2.3</span> GitBucket のインストールと起動</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li><a href="https://github.com/takezoe/gitbucket/releases">https://github.com/takezoe/gitbucket/releases</a> から gitbucket.war をダウンロード</li>
<li><p>
システム環境変数に以下の環境変数を設定
</p>
<pre class="example">
GITBUCKET_HOME=C:/GitBucket
</pre></li>
<li>C:/Program Files/Apache Software Foundation/Tomcat 8.5/webapps に war ファイルを配置</li>
<li>C:/Program Files/Apache Software Foundation/Tomcat 8.5/bin/Tomcat8w.exe を起動</li>
<li>[Start] で実行</li>
<li><a href="http://hostname:8080/gitbucket">http://hostname:8080/gitbucket</a> へ接続</li>
<li>root/root でログイン確認</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgce5346f" class="outline-2">
<h2 id="orgce5346f"><span class="section-number-2">3</span> 参考</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://github.com/gitbucket/gitbucket">GitHub - gitbucket/gitbucket: A Git platform powered by Scala with easy installation, high extensibility &amp; github API compatibility</a></li>
<li><a href="http://qiita.com/yuann/items/5759a11a49dd0580d80b">Windows 環境で GitBucket - Qiita</a></li>
<li><a href="http://celtislab.net/archives/20140520/git-step1/">Git 入門（GitBucket と SourceTree の準備） – セルティスラボ</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: clothoid</p>
<p class="date">Created: 2020-09-12 Sat 07:25</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
